garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F04Q40.PIC
      <edc:DCRDef edc:access="-------n" edc:cname="CONFIG9" edc:desc="Configuration byte 10" edc:factorydefault="0xff" edc:impl="0x01" edc:name="CONFIG9" edc:nzwidth="8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x01" edc:default="0xff" edc:_addr="0x300008">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CP" edc:desc="PFM and Data EEPROM Code Protection bit" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PFM and Data EEPROM code protection disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PFM and Data EEPROM code protection enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0000" edc:checksumalgo="0x27" edc:endaddr="0x20000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:EEDataSector edc:beginaddr="0x380000" edc:endaddr="0x380200" edc:regionid="eedata"/>
    <edc:DIASector edc:beginaddr="0x2C0000" edc:endaddr="0x2C0100" edc:regionid="diamem">
      <edc:RegisterArray edc:cname="MUI" edc:_addr="0x2C0000">
        <edc:Register edc:cname="MUI0" edc:nzwidth="16" edc:_addr="0x2C0000"/>
        <edc:Register edc:cname="MUI1" edc:nzwidth="16" edc:_addr="0x2C0002"/>
        <edc:Register edc:cname="MUI2" edc:nzwidth="16" edc:_addr="0x2C0004"/>
        <edc:Register edc:cname="MUI3" edc:nzwidth="16" edc:_addr="0x2C0006"/>
        <edc:Register edc:cname="MUI4" edc:nzwidth="16" edc:_addr="0x2C0008"/>
        <edc:Register edc:cname="MUI5" edc:nzwidth="16" edc:_addr="0x2C000A"/>
        <edc:Register edc:cname="MUI6" edc:nzwidth="16" edc:_addr="0x2C000C"/>
        <edc:Register edc:cname="MUI7" edc:nzwidth="16" edc:_addr="0x2C000E"/>
        <edc:Register edc:cname="MUI8" edc:nzwidth="16" edc:_addr="0x2C0010"/>
        <edc:Register edc:cname="MUI9" edc:nzwidth="16" edc:_addr="0x2C0012"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="EUI" edc:_addr="0x2C0014">
        <edc:Register edc:cname="EUI0" edc:nzwidth="16" edc:_addr="0x2C0014"/>
        <edc:Register edc:cname="EUI1" edc:nzwidth="16" edc:_addr="0x2C0016"/>
        <edc:Register edc:cname="EUI2" edc:nzwidth="16" edc:_addr="0x2C0018"/>
        <edc:Register edc:cname="EUI3" edc:nzwidth="16" edc:_addr="0x2C001A"/>
        <edc:Register edc:cname="EUI4" edc:nzwidth="16" edc:_addr="0x2C001C"/>
        <edc:Register edc:cname="EUI5" edc:nzwidth="16" edc:_addr="0x2C001E"/>
        <edc:Register edc:cname="EUI6" edc:nzwidth="16" edc:_addr="0x2C0020"/>
        <edc:Register edc:cname="EUI7" edc:nzwidth="16" edc:_addr="0x2C0022"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="TSLR" edc:_addr="0x2C0024">
        <edc:Register edc:cname="TSLR1" edc:nzwidth="16" edc:_addr="0x2C0024"/>
        <edc:Register edc:cname="TSLR2" edc:nzwidth="16" edc:_addr="0x2C0026"/>
        <edc:Register edc:cname="TSLR3" edc:nzwidth="16" edc:_addr="0x2C0028"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="TSHR" edc:_addr="0x2C002A">
        <edc:Register edc:cname="TSHR1" edc:nzwidth="16" edc:_addr="0x2C002A"/>
        <edc:Register edc:cname="TSHR2" edc:nzwidth="16" edc:_addr="0x2C002C"/>
        <edc:Register edc:cname="TSHR3" edc:nzwidth="16" edc:_addr="0x2C002E"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="FVRA" edc:_addr="0x2C0030">
        <edc:Register edc:cname="FVRA1X" edc:nzwidth="16" edc:_addr="0x2C0030"/>
        <edc:Register edc:cname="FVRA2X" edc:nzwidth="16" edc:_addr="0x2C0032"/>
        <edc:Register edc:cname="FVRA4X" edc:nzwidth="16" edc:_addr="0x2C0034"/>
      </edc:RegisterArray>
      <edc:RegisterArray edc:cname="FVRC" edc:_addr="0x2C0036">
        <edc:Register edc:cname="FVRC1X" edc:nzwidth="16" edc:_addr="0x2C0036"/>
        <edc:Register edc:cname="FVRC2X" edc:nzwidth="16" edc:_addr="0x2C0038"/>
        <edc:Register edc:cname="FVRC4X" edc:nzwidth="16" edc:_addr="0x2C003A"/>
      </edc:RegisterArray>
    </edc:DIASector>
    <edc:DCISector edc:beginaddr="0x3C0000" edc:endaddr="0x3C0100" edc:regionid="dcimem">
      <edc:Register edc:cname="ERSIZ" edc:nzwidth="16" edc:_addr="0x3C0000"/>
      <edc:Register edc:cname="WLSIZ" edc:nzwidth="16" edc:_addr="0x3C0002"/>
      <edc:Register edc:cname="URSIZ" edc:nzwidth="16" edc:_addr="0x3C0004"/>
      <edc:Register edc:cname="EESIZ" edc:nzwidth="16" edc:_addr="0x3C0006"/>
      <edc:Register edc:cname="PCNT" edc:nzwidth="16" edc:_addr="0x3C0008"/>
    </edc:DCISector>
    <edc:RevisionIDSector edc:beginaddr="0x3FFFFC" edc:endaddr="0x3FFFFE" edc:regionid="revid">
      <edc:DEVIDToRev edc:revlist="A0" edc:value="0x7640"/>
    </edc:RevisionIDSector>
    <edc:DeviceIDSector edc:beginaddr="0x3FFFFE" edc:endaddr="0x400000" edc:regionid="devid" edc:value="0x7640"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x0900">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:bank="0x0" edc:beginaddr="0x0000" edc:endaddr="0x0100" edc:regionid="sfr0">
        <edc:AdjustPoint edc:offset="0x39" edc:_addr="0x0"/>
        <edc:SFRDef edc:access="n--nnnnn" edc:cname="CLKRCON" edc:desc="" edc:impl="0x9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--10000" edc:name="CLKRCON" edc:nzwidth="8" edc:por="0--10000" edc:_modsrc="DOS-02548_clk_refout_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x39">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DIV" edc:mask="0x7" edc:name="DIV" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DC" edc:mask="0x3" edc:name="DC" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV0" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV1" edc:mask="0x1" edc:name="CLKRDIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV2" edc:mask="0x1" edc:name="CLKRDIV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC0" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC1" edc:mask="0x1" edc:name="CLKRDC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CLKREN" edc:desc="" edc:mask="0x1" edc:name="CLKREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DIV0" edc:mask="0x1" edc:name="DIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIV1" edc:mask="0x1" edc:name="DIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIV2" edc:mask="0x1" edc:name="DIV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC0" edc:mask="0x1" edc:name="DC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC1" edc:mask="0x1" edc:name="DC1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CLKRCLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CLKRCLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02548_clk_refout_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x3A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:desc="" edc:mask="0xf" edc:name="CLK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRCLK0" edc:mask="0x1" edc:name="CLKRCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK1" edc:mask="0x1" edc:name="CLKRCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK2" edc:mask="0x1" edc:name="CLKRCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK3" edc:mask="0x1" edc:name="CLKRCLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x05" edc:_addr="0x3B"/>
        <edc:SFRDef edc:access="-------n" edc:cname="NVMCON0" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------u" edc:name="NVMCON0" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x40">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="nDONE" edc:mask="0x1" edc:name="nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NVMGO" edc:mask="0x1" edc:name="NVMGO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="NVMCON1" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u----uuu" edc:name="NVMCON1" edc:nzwidth="8" edc:por="0----000" edc:_addr="0x41">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x7" edc:name="CMD" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NVMCMD" edc:mask="0x7" edc:name="NVMCMD" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMLOCK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMLOCK" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x42">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LOCK" edc:mask="0xff" edc:name="LOCK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
