garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F04Q40.PIC
        <edc:SFRDef edc:access="-------n" edc:cname="PRLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PRLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0xB4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRLOCKED" edc:mask="0x1" edc:name="PRLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SCANPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="SCANPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANPR" edc:mask="0x7" edc:name="SCANPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SCANPR0" edc:mask="0x1" edc:name="SCANPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANPR1" edc:mask="0x1" edc:name="SCANPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANPR2" edc:mask="0x1" edc:name="SCANPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA1PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA1PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA1PR" edc:mask="0x7" edc:name="DMA1PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA1PR0" edc:mask="0x1" edc:name="DMA1PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1PR1" edc:mask="0x1" edc:name="DMA1PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1PR2" edc:mask="0x1" edc:name="DMA1PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA2PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA2PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA2PR" edc:mask="0x7" edc:name="DMA2PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA2PR0" edc:mask="0x1" edc:name="DMA2PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2PR1" edc:mask="0x1" edc:name="DMA2PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2PR2" edc:mask="0x1" edc:name="DMA2PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA3PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA3PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA3PR" edc:mask="0x7" edc:name="DMA3PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA3PR0" edc:mask="0x1" edc:name="DMA3PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3PR1" edc:mask="0x1" edc:name="DMA3PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3PR2" edc:mask="0x1" edc:name="DMA3PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA4PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA4PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA4PR" edc:mask="0x7" edc:name="DMA4PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA4PR0" edc:mask="0x1" edc:name="DMA4PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4PR1" edc:mask="0x1" edc:name="DMA4PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4PR2" edc:mask="0x1" edc:name="DMA4PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xBA"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="MAINPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="MAINPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xBE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MAINPR" edc:mask="0x7" edc:name="MAINPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MAINPR0" edc:mask="0x1" edc:name="MAINPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAINPR1" edc:mask="0x1" edc:name="MAINPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAINPR2" edc:mask="0x1" edc:name="MAINPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ISRPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ISRPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xBF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ISRPR" edc:mask="0x7" edc:name="ISRPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ISRPR0" edc:mask="0x1" edc:name="ISRPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISRPR1" edc:mask="0x1" edc:name="ISRPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISRPR2" edc:mask="0x1" edc:name="ISRPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x14" edc:_addr="0xC0"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CLCDATA" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CLCDATA" edc:nzwidth="8" edc:por="----0000" edc:_addr="0xD4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLC1OUT" edc:mask="0x1" edc:name="CLC1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2OUT" edc:mask="0x1" edc:name="CLC2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC3OUT" edc:mask="0x1" edc:name="CLC3OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4OUT" edc:mask="0x1" edc:name="CLC4OUT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CLCSELECT" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CLCSELECT" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-02286_cla_clc_v5_8bit_stacked.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0xD5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLCT" edc:mask="0x3" edc:name="SLCT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLCT0" edc:mask="0x1" edc:name="SLCT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLCT1" edc:mask="0x1" edc:name="SLCT1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
