garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F04Q40.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC4PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x215">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC4PPS0" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS1" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS2" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS3" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS4" edc:mask="0x1" edc:name="RC4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4PPS5" edc:mask="0x1" edc:name="RC4PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RC5PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RC5PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x216">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC5PPS0" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS1" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS2" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS3" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS4" edc:mask="0x1" edc:name="RC5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5PPS5" edc:mask="0x1" edc:name="RC5PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x217"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x218"/>
        <edc:AdjustPoint edc:offset="0x25" edc:_addr="0x219"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT0PPS" edc:nzwidth="8" edc:por="--000010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x23E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT0PPS0" edc:mask="0x1" edc:name="INT0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS1" edc:mask="0x1" edc:name="INT0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS2" edc:mask="0x1" edc:name="INT0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS3" edc:mask="0x1" edc:name="INT0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS4" edc:mask="0x1" edc:name="INT0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS5" edc:mask="0x1" edc:name="INT0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT0PPS" edc:mask="0x3f" edc:name="INT0PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT1PPS" edc:nzwidth="8" edc:por="--000100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x23F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT1PPS0" edc:mask="0x1" edc:name="INT1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS1" edc:mask="0x1" edc:name="INT1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS2" edc:mask="0x1" edc:name="INT1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS3" edc:mask="0x1" edc:name="INT1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS4" edc:mask="0x1" edc:name="INT1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS5" edc:mask="0x1" edc:name="INT1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT1PPS" edc:mask="0x3f" edc:name="INT1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT2PPS" edc:nzwidth="8" edc:por="--000101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x240">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2PPS0" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS1" edc:mask="0x1" edc:name="INT2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS2" edc:mask="0x1" edc:name="INT2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS3" edc:mask="0x1" edc:name="INT2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS4" edc:mask="0x1" edc:name="INT2PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS5" edc:mask="0x1" edc:name="INT2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT2PPS" edc:mask="0x3f" edc:name="INT2PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T0CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T0CKIPPS" edc:nzwidth="8" edc:por="--000010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x241">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0CKIPPS" edc:mask="0x3f" edc:name="T0CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS0" edc:mask="0x1" edc:name="T0CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS1" edc:mask="0x1" edc:name="T0CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS2" edc:mask="0x1" edc:name="T0CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS3" edc:mask="0x1" edc:name="T0CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS4" edc:mask="0x1" edc:name="T0CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS5" edc:mask="0x1" edc:name="T0CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T1CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T1CKIPPS" edc:nzwidth="8" edc:por="--000101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x242">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS0" edc:mask="0x1" edc:name="T1CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS1" edc:mask="0x1" edc:name="T1CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS2" edc:mask="0x1" edc:name="T1CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS3" edc:mask="0x1" edc:name="T1CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS4" edc:mask="0x1" edc:name="T1CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS5" edc:mask="0x1" edc:name="T1CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1CKIPPS" edc:mask="0x3f" edc:name="T1CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T1GPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T1GPPS" edc:nzwidth="8" edc:por="--000100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x243">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1GPPS0" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS1" edc:mask="0x1" edc:name="T1GPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS2" edc:mask="0x1" edc:name="T1GPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS3" edc:mask="0x1" edc:name="T1GPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS4" edc:mask="0x1" edc:name="T1GPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS5" edc:mask="0x1" edc:name="T1GPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1GPPS" edc:mask="0x3f" edc:name="T1GPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T3CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T3CKIPPS" edc:nzwidth="8" edc:por="--010101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x244">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3CKIPPS0" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS1" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS2" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS3" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS4" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS5" edc:mask="0x1" edc:name="T3CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3CKIPPS" edc:mask="0x3f" edc:name="T3CKIPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T3GPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T3GPPS" edc:nzwidth="8" edc:por="--010100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x245">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3GPPS0" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS1" edc:mask="0x1" edc:name="T3GPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS2" edc:mask="0x1" edc:name="T3GPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS3" edc:mask="0x1" edc:name="T3GPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS4" edc:mask="0x1" edc:name="T3GPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS5" edc:mask="0x1" edc:name="T3GPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3GPPS" edc:mask="0x3f" edc:name="T3GPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x246"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T2INPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T2INPPS" edc:nzwidth="8" edc:por="--000101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x248">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2INPPS0" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS1" edc:mask="0x1" edc:name="T2INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS2" edc:mask="0x1" edc:name="T2INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS3" edc:mask="0x1" edc:name="T2INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS4" edc:mask="0x1" edc:name="T2INPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS5" edc:mask="0x1" edc:name="T2INPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2INPPS" edc:mask="0x3f" edc:name="T2INPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
