garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F04Q40.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LTH" edc:desc="" edc:mask="0xff" edc:name="LTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH8" edc:desc="" edc:mask="0x1" edc:name="ADLTH8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH9" edc:desc="" edc:mask="0x1" edc:name="ADLTH9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH10" edc:desc="" edc:mask="0x1" edc:name="ADLTH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH11" edc:desc="" edc:mask="0x1" edc:name="ADLTH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH12" edc:desc="" edc:mask="0x1" edc:name="ADLTH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH13" edc:desc="" edc:mask="0x1" edc:name="ADLTH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH14" edc:desc="" edc:mask="0x1" edc:name="ADLTH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH15" edc:desc="" edc:mask="0x1" edc:name="ADLTH15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADLTH" edc:mask="0xff" edc:name="ADLTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="LTH8" edc:mask="0x1" edc:name="LTH8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH9" edc:mask="0x1" edc:name="LTH9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH10" edc:mask="0x1" edc:name="LTH10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH11" edc:mask="0x1" edc:name="LTH11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH12" edc:mask="0x1" edc:name="LTH12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH13" edc:mask="0x1" edc:name="LTH13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH14" edc:mask="0x1" edc:name="LTH14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH15" edc:mask="0x1" edc:name="LTH15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADUTH" edc:desc="" edc:name="ADUTH" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DB">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADUTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADUTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="UTH" edc:desc="" edc:mask="0xff" edc:name="UTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADUTH0" edc:desc="" edc:mask="0x1" edc:name="ADUTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH1" edc:desc="" edc:mask="0x1" edc:name="ADUTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH2" edc:desc="" edc:mask="0x1" edc:name="ADUTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH3" edc:desc="" edc:mask="0x1" edc:name="ADUTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH4" edc:desc="" edc:mask="0x1" edc:name="ADUTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH5" edc:desc="" edc:mask="0x1" edc:name="ADUTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH6" edc:desc="" edc:mask="0x1" edc:name="ADUTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH7" edc:desc="" edc:mask="0x1" edc:name="ADUTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADUTH" edc:mask="0xff" edc:name="ADUTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="UTH0" edc:mask="0x1" edc:name="UTH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH1" edc:mask="0x1" edc:name="UTH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH2" edc:mask="0x1" edc:name="UTH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH3" edc:mask="0x1" edc:name="UTH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH4" edc:mask="0x1" edc:name="UTH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH5" edc:mask="0x1" edc:name="UTH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH6" edc:mask="0x1" edc:name="UTH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH7" edc:mask="0x1" edc:name="UTH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADUTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADUTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DC">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="UTH" edc:desc="" edc:mask="0xff" edc:name="UTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADUTH8" edc:desc="" edc:mask="0x1" edc:name="ADUTH8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH9" edc:desc="" edc:mask="0x1" edc:name="ADUTH9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH10" edc:desc="" edc:mask="0x1" edc:name="ADUTH10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH11" edc:desc="" edc:mask="0x1" edc:name="ADUTH11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH12" edc:desc="" edc:mask="0x1" edc:name="ADUTH12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH13" edc:desc="" edc:mask="0x1" edc:name="ADUTH13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH14" edc:desc="" edc:mask="0x1" edc:name="ADUTH14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADUTH15" edc:desc="" edc:mask="0x1" edc:name="ADUTH15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADUTH" edc:mask="0xff" edc:name="ADUTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="UTH8" edc:mask="0x1" edc:name="UTH8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH9" edc:mask="0x1" edc:name="UTH9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH10" edc:mask="0x1" edc:name="UTH10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH11" edc:mask="0x1" edc:name="UTH11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH12" edc:mask="0x1" edc:name="UTH12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH13" edc:mask="0x1" edc:name="UTH13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH14" edc:mask="0x1" edc:name="UTH14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="UTH15" edc:mask="0x1" edc:name="UTH15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="ADERR" edc:desc="" edc:name="ADERR" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DD">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADERRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADERRL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DD">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ERR" edc:desc="" edc:mask="0xff" edc:name="ERR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADERR0" edc:desc="" edc:mask="0x1" edc:name="ADERR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR1" edc:desc="" edc:mask="0x1" edc:name="ADERR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR2" edc:desc="" edc:mask="0x1" edc:name="ADERR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR3" edc:desc="" edc:mask="0x1" edc:name="ADERR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR4" edc:desc="" edc:mask="0x1" edc:name="ADERR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR5" edc:desc="" edc:mask="0x1" edc:name="ADERR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR6" edc:desc="" edc:mask="0x1" edc:name="ADERR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR7" edc:desc="" edc:mask="0x1" edc:name="ADERR7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADERR" edc:mask="0xff" edc:name="ADERR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ERR0" edc:mask="0x1" edc:name="ERR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR1" edc:mask="0x1" edc:name="ERR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR2" edc:mask="0x1" edc:name="ERR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR3" edc:mask="0x1" edc:name="ERR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR4" edc:mask="0x1" edc:name="ERR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR5" edc:mask="0x1" edc:name="ERR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR6" edc:mask="0x1" edc:name="ERR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR7" edc:mask="0x1" edc:name="ERR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="ADERRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADERRH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3DE">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ERR" edc:desc="" edc:mask="0xff" edc:name="ERR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADERR8" edc:desc="" edc:mask="0x1" edc:name="ADERR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR9" edc:desc="" edc:mask="0x1" edc:name="ADERR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR10" edc:desc="" edc:mask="0x1" edc:name="ADERR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR11" edc:desc="" edc:mask="0x1" edc:name="ADERR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR12" edc:desc="" edc:mask="0x1" edc:name="ADERR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR13" edc:desc="" edc:mask="0x1" edc:name="ADERR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR14" edc:desc="" edc:mask="0x1" edc:name="ADERR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADERR15" edc:desc="" edc:mask="0x1" edc:name="ADERR15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADERR" edc:mask="0xff" edc:name="ADERR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ERR8" edc:mask="0x1" edc:name="ERR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR9" edc:mask="0x1" edc:name="ERR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR10" edc:mask="0x1" edc:name="ERR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR11" edc:mask="0x1" edc:name="ERR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR12" edc:mask="0x1" edc:name="ERR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR13" edc:mask="0x1" edc:name="ERR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR14" edc:mask="0x1" edc:name="ERR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ERR15" edc:mask="0x1" edc:name="ERR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
